app/controllers/algorithms_controller.rb

    def index
        render json: Algorithm.all
---
SELECT "algorithms".* FROM "algorithms"

    def show
        algorithm = Algorithm.find(params[:id])
---
SELECT "algorithms".* FROM "algorithms" WHERE "algorithms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]