app/controllers/application_controller.rb

  def current_user
    @current_user ||= User.find_by_id(session[:user_id]) # memoization: caching experience
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]