app/controllers/solutions_controller.rb

SELECT "solutions".* FROM "solutions"
---
    def index
        render json: Solution.all

SELECT "solutions".* FROM "solutions" WHERE "solutions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        solution = Solution.find(params[:id])

INSERT INTO "solutions" ("user_id", "algorithm_id", "solution", "time_complexity", "space_complexity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        solution = Solution.create!(s_params)

SELECT "solutions".* FROM "solutions" WHERE "solutions"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "solutions" WHERE "solutions"."id" = $1  [["id", 5]]
---
    def destroy
        solution = Solution.find(params[:id])
        solution.destroy