app/controllers/users_controller.rb

    def index
        render json: User.all
---
SELECT "users".* FROM "users"

    def show
        user = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]